<a href="https://colab.research.google.com/github/akortheanchor/Seaborn/blob/master/PandaDF.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import os

In [0]:
My_DataFrame = pd. DataFrame(
{"Col_1":[1,2,3],
"col_2":['Akor\'s','own','Dataframe'],
"col_3":[True,False,True],
"col_4":[1,2,3]})

In [0]:
My_DataFrame

   Col_1      col_2  col_3  col_4
0      1     Akor's   True      1
1      2        own  False      2
2      3  Dataframe   True      3

In [0]:
os.getcwd()

'/content'

In [0]:
os.getuid()

0

In [0]:
os.uname()

posix.uname_result(sysname='Linux', nodename='3e076f8e2091', release='4.14.79+', version='#1 SMP Wed Dec 19 21:19:13 PST 2018', machine='x86_64')

In [0]:
import pandas as pd
import numpy as np

In [0]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Jacobson', ".", 'Milner', 'Cooze'], 
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, ".", "."],
        'postTestScore': ["25,000", "94,000", 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

  first_name last_name  age preTestScore postTestScore
0      Jason    Miller   42            4        25,000
1      Molly  Jacobson   52           24        94,000
2       Tina         .   36           31            57
3       Jake    Milner   24            .            62
4        Amy     Cooze   73            .            70

In [0]:
nme = ["aparna", "pankaj", "sudhir", "Geeku"] 
deg = ["MBA", "BCA", "M.Tech", "MBA"] 
scr = [90, 40, 80, 98] 
dict = {'name': nme, 'degree': deg, 'score': scr}  
df = pd.DataFrame(dict) 
df.to_csv('file1.csv')

In [0]:
#importing pandas as pd  
import pandas as pd  
   
# list of name, degree, score 
nme = ["aparna", "pankaj", "sudhir", "Geeku"] 
deg = ["MBA", "BCA", "M.Tech", "MBA"] 
scr = [90, 40, 80, 98]

In [0]:
# dictionary of lists  
dict = {'name': nme, 'degree': deg, 'score': scr}

In [0]:
df = pd.DataFrame(dict)

In [0]:
# saving the dataframe 
df.to_csv('file2.csv', header=False, index=False)